Version2/TestTool/TestTool.Setup/Requests/RecordingControl/CreateRecording/CreateRecording.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope
 xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
 xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
 xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <trc:CreateRecording>
      <trc:RecordingConfiguration>
        <trc:Source>
          <trc:SourceID>http://www.w3.org/2005/08/addressing/anonymous</trc:SourceID>
          <trc:Name>Recording1</trc:Name>
          <trc:Location>Location description</trc:Location>
          <trc:Description>Source Description</trc:Description>
          <trc:Address>http://www.w3.org/2005/08/addressing/anonymous</trc:Address>
        </trc:Source>
        <trc:Contetnt>Content description</trc:Contetnt>
        <trc:MaximumRetentionTime>PT10S</trc:MaximumRetentionTime>
      </trc:RecordingConfiguration>
    </trc:CreateRecording>
  </soap:Body>
</soap:Envelope>